In [18]:
import mysql.connector
import pandas as pd

In [14]:
db = mysql.connector.connect(
    host="remotemysql.com",
    user="kQkFpENNBJ",
    passwd="ZbRVpmcjR4",
    database="kQkFpENNBJ"
)

if db.is_connected():
    print("Koneksi sukses!")

    
cur = db.cursor()

Koneksi sukses!

In [8]:
sql = '''
CREATE TABLE student (
  student_id INT AUTO_INCREMENT PRIMARY KEY,
  name VARCHAR(255),
  address Varchar(255)
)
'''

cur.execute(sql)

In [15]:
sql1 = '''
INSERT INTO student (name, address) VALUES (%s, %s)
'''

val = [("Asta", "Jakarta"),
        ("Hedy","Bengkulu"),
        ("Raihan","Yogyakarta")]

for val in val:
  cur.execute(sql1, val)
  db.commit()

In [ ]:
sekolah = pd.DataFrame({
    'name':['Aco','Excell','Putra','Daniel','Mahes','Farras'],
    'address':['Bandung','Radio Dalam','Jakbar','Jaksel','Cirendeu','Disana dah gua gatau']
})

In [21]:
sekolah

     name               address
0     Aco               Bandung
1  Excell           Radio Dalam
2   Putra                Jakbar
3  Daniel                Jaksel
4   Mahes              Cirendeu
5  Farras  Disana dah gua gatau

In [23]:
db = mysql.connector.connect(
    host="remotemysql.com",
    user="kQkFpENNBJ",
    passwd="ZbRVpmcjR4",
    database="kQkFpENNBJ"
)
cur = db.cursor()


for val in zip(sekolah['name'],sekolah['address']):
    sql2 = "INSERT INTO student (name, address) VALUES (%s, %s)"
    cur.execute(sql2,val)
    db.commit()

In [24]:
sekolah2 = pd.DataFrame({
    'name':['Orang','Org2','Org3',],
    'address':['Bandung','Radio Dalam','Jakbar']
})

In [26]:
db = mysql.connector.connect(
    host="remotemysql.com",
    user="kQkFpENNBJ",
    passwd="ZbRVpmcjR4",
    database="kQkFpENNBJ"
)
cur = db.cursor()


for i in range(len(sekolah2)):
    sql3 = f"INSERT INTO student (name, address) VALUES ('{sekolah2['name'][i]}', '{sekolah2['address'][i]}')"
    cur.execute(sql3)
    db.commit()

In [28]:
db = mysql.connector.connect(
    host="remotemysql.com",
    user="kQkFpENNBJ",
    passwd="ZbRVpmcjR4",
    database="kQkFpENNBJ"
)
cur = db.cursor()

sql4 = '''
select * from student
'''

cur.execute(sql4)
result = cur.fetchall()

result

[(2, 'Alex', 'Jakarta'),
 (3, 'Asta', 'Jakarta'),
 (4, 'Hedy', 'Bengkulu'),
 (5, 'Raihan', 'Yogyakarta'),
 (6, 'Aco', 'Bandung'),
 (7, 'Excell', 'Radio Dalam'),
 (8, 'Putra', 'Jakbar'),
 (9, 'Daniel', 'Jaksel'),
 (10, 'Mahes', 'Cirendeu'),
 (11, 'Farras', 'Disana dah gua gatau'),
 (12, 'Orang', 'Bandung'),
 (13, 'Org2', 'Radio Dalam'),
 (14, 'Org3', 'Jakbar')]

In [30]:
pembacaan = pd.read_sql_query(sql4, db)
pembacaan

c:\Users\alexa\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    student_id    name               address
0            2    Alex               Jakarta
1            3    Asta               Jakarta
2            4    Hedy              Bengkulu
3            5  Raihan            Yogyakarta
4            6     Aco               Bandung
5            7  Excell           Radio Dalam
6            8   Putra                Jakbar
7            9  Daniel                Jaksel
8           10   Mahes              Cirendeu
9           11  Farras  Disana dah gua gatau
10          12   Orang               Bandung
11          13    Org2           Radio Dalam
12          14    Org3                Jakbar